[
  {
    "id": 1,
    "title": "Menjelajahi Pulau Kembang",
    "introduction": "Selamat datang di Taman Wisata Alam Pulau Kembang! Pulau ini terletak di tengah Sungai Barito dan merupakan kawasan konservasi yang penting untuk menjaga ekosistem hutan rawa mangrove serta satwa yang hidup di dalamnya. Pulau Kembang menjadi rumah bagi berbagai flora dan fauna khas lahan basah. Dalam perjalanan ini, kamu akan mempelajari lebih dalam tentang lingkungan yang unik dan langkah-langkah pelestariannya.",
    "missions": [
      {
        "id": 1,
        "title": "Menampilkan Biaya Kunjungan",
        "dialogs": [
          {
            "type": "narration",
            "text": "Sebelum memulai, mari mengenal bagian antarmuka dan komponen permainan!"
          },
          {
            "type": "narration",
            "text": "Bagus! Setelah mengenal bagian antarmuka dan komponen permainan, mari kita mulai!"
          },
          {
            "type": "narration",
            "text": "Sebelum mulai menjelajahi Pulau Kembang, penting untuk mengetahui biaya kunjungan."
          },
          {
            "type": "narration",
            "text": "Kawasan konservasi ini menerima pengunjung lokal dan mancanegara, dengan tarif yang berbeda termasuk tarif khusus pada hari-hari libur."
          },
          {
            "type": "instruction",
            "text": "Ayo kita lihat semua harga tiket masuk untuk berbagai kategori pengunjung di Pulau Kembang dari data **biaya**.",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM biaya;"
            }
          },
          {
            "type": "narration",
            "text": " Bagus! Kamu sekarang tahu biaya yang dikenakan untuk mengunjungi Pulau Kembang, termasuk tarif khusus untuk hari libur dan wisatawan mancanegara."
          }
        ]
      },
      {
        "id": 2,
        "title": "Menampilkan Jenis Petugas",
        "dialogs": [
          {
            "type": "narration",
            "text": "Taman Wisata Alam Pulau Kembang memerlukan petugas yang bertugas menjaga kawasan ini agar tetap nyaman bagi para pengunjung."
          },
          {
            "type": "narration",
            "text": "Pulau Kembang memiliki berbagai peran petugas yang berbeda-beda."
          },
          {
            "type": "instruction",
            "text": "Ayo cek semua jenis **tugas** petugas di Pulau Kembang. Pastikan tidak ada duplikasi pada data yang ditampilkan dari data **petugas**.",
            "sql": {
              "type": "exec",
              "query": "SELECT DISTINCT tugas FROM petugas;"
            }
          },
          {
            "type": "narration",
            "text": "Bagus sekali! Kamu sekarang tahu peran petugas yang bekerja di Pulau Kembang ini."
          }
        ]
      },
      {
        "id": 3,
        "title": "Menampilkan Fasilitas yang Tersedia",
        "dialogs": [
          {
            "type": "narration",
            "text": "Pulau Kembang dilengkapi dengan berbagai fasilitas yang mendukung aktivitas wisatawan, seperti pusat informasi dan tempat istirahat. "
          },
          {
            "type": "instruction",
            "text": "Mari kita lihat semua fasilitas yang ada di Pulau Kembang pada data **fasilitas**.",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM fasilitas;"
            }
          },
          {
            "type": "narration",
            "text": "Bagus! Kamu sekarang tahu semua fasilitas yang ada di Pulau Kembang."
          }
        ]
      },
      {
        "id": 4,
        "title": "Menampilkan Semua Flora yang Ada",
        "dialogs": [
          {
            "type": "narration",
            "text": "Pulau Kembang merupakan representasi ekosistem lahan basah yang unik dengan berbagai jenis tumbuhan."
          },
          {
            "type": "narration",
            "text": "Tumbuhan seperti rambai, pandan, dan nipah tumbuh subur di pulau ini."
          },
          {
            "type": "narration",
            "text": "Sehingga menciptakan lingkungan yang ideal bagi flora dan fauna untuk berkembang."
          },
          {
            "type": "instruction",
            "text": "Sekarang, coba lihat daftar semua jenis tumbuhan yang ada di Pulau Kembang dari data **tumbuhan**.",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM tumbuhan;"
            }
          },
          {
            "type": "narration",
            "text": "Bagus sekali! Kamu sekarang mengetahui berbagai jenis tumbuhan yang ada di Pulau Kembang."
          },
          {
            "type": "narration",
            "text": "Beberapa tumbuhan di Pulau Kembang memiliki status konservasi yang berbeda-beda."
          },
          {
            "type": "narration",
            "text": "Sekarang, mari kita fokus pada tumbuhan yang tidak termasuk dalam kategori 'Near Threatened' untuk melihat status lain yang ada."
          },
          {
            "type": "instruction",
            "text": "Tampilkan data **tumbuhan** yang **status konservasinya bukan** Near Threatened.",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM tumbuhan WHERE NOT status_konservasi = 'Near Threatened';"
            }
          },
          {
            "type": "narration",
            "text": "Bagus sekali! Kamu telah menemukan tumbuhan dengan status konservasi selain 'Near Threatened'."
          },
          {
            "type": "narration",
            "text": "Informasi ini penting untuk memahami kondisi konservasi flora yang ada di Pulau Kembang."
          }
        ]
      },
      {
        "id": 5,
        "title": "Menampilkan Semua Fauna yang Ada",
        "dialogs": [
          {
            "type": "narration",
            "text": "Selain tumbuhan, Pulau Kembang juga dihuni oleh berbagai spesies hewan."
          },
          {
            "type": "narration",
            "text": "Hewan seperti bekantan dan berbagai jenis burung menjadikan pulau ini tempat tinggal mereka."
          },
          {
            "type": "narration",
            "text": "Ini menunjukkan pentingnya kawasan ini bagi keanekaragaman hayati."
          },
          {
            "type": "instruction",
            "text": "Tampilkan semua isi dari data **hewan** untuk mengetahui berbagai spesies yang bisa kamu temui di pulau ini.",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM hewan;"
            }
          },
          {
            "type": "instruction",
            "text": "Coba cari data **hewan** yang memiliki **lama hidup** di bawah 5 tahun. Petunjuk : Sesuaikan penulisan dengan nama kolom di data hewan. ",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM hewan WHERE lama_hidup < 5;"
            }
          },
          {
            "type": "narration",
            "text": "Hebat! Kamu kini memiliki informasi tentang berbagai spesies hewan yang lama hidupnya kurang dari 5 tahun."
          }
        ]
      }
    ],
    "closing": "Selamat! Kamu telah menyelesaikan semua misi di stage ini. Dengan informasi yang kamu kumpulkan, kamu kini siap untuk menjelajahi Pulau Kembang dengan lebih baik. Nikmati petualanganmu dan semoga kamu mendapatkan pengalaman yang tak terlupakan!",
    "filepath": "stage1.db"
  },
  {
    "id": 2,
    "title": "Memahami Populasi Tumbuhan",
    "introduction": "Selamat datang kembali di Pulau Kembang! Setelah mengenal keragaman hayati yang ada di Pulau kembang di stage sebelumnya, kamu akan berperan sebagai peneliti yang bertugas memonitor dan melindungi tumbuhan di Pulau Kembang. Setiap misi yang kamu selesaikan akan membantu menjaga keseimbangan ekosistem dan memastikan kelangsungan hidup tumbuhan-tumbuhan penting ini. Bersiaplah untuk memulai perjalananmu dalam upaya konservasi yang mulia ini!",
    "missions": [
      {
        "id": 1,
        "title": "Memeriksa Jumlah Tumbuhan",
        "dialogs": [
          {
            "type": "narration",
            "text": "Mari kita periksa tumbuhan dengan jumlah lebih dari 25 di Pulau Kembang untuk mengetahui seberapa banyak populasi tumbuhan yang dominan."
          },
          {
            "type": "instruction",
            "text": "Temukan semua tumbuhan yang memiliki **jumlah** lebih dari 25 di data **tumbuhan**. ",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM Tumbuhan WHERE jumlah > 25;"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah menemukan tumbuhan dengan jumlah lebih dari 25."
          }
        ]
      },
      {
        "id": 2,
        "title": "Mencari Tumbuhan dengan Status Konservasi Tertentu",
        "dialogs": [
          {
            "type": "narration",
            "text": "Lahan basah sering menjadi habitat bagi spesies tumbuhan yang rentan terhadap perubahan lingkungan. "
          },
          {
            "type": "instruction",
            "text": "Temukan data **tumbuhan** dengan **status konservasi** yaitu **Near Threatened**. **Petunjuk** : Sesuaikan penulisan isi data dan kolom dengan tabel tumbuhan.",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM Tumbuhan WHERE status_konservasi = 'Near Threatened';"
            }
          },
          {
            "type": "narration",
            "text": "Tumbuhan dengan status 'Near Threatened' yang kamu temukan membutuhkan upaya pelestarian khusus agar dapat bertahan di lahan basah yang terus berubah."
          }
        ]
      },
      {
        "id": 3,
        "title": "Mengidentifikasi Tumbuhan Berjumlah Sedikit",
        "dialogs": [
          {
            "type": "narration",
            "text": "Spesies dengan populasi kecil sering kali rentan terhadap kepunahan."
          },
          {
            "type": "narration",
            "text": "Identifikasi tumbuhan yang jumlahnya 15 atau kurang untuk memastikan kelangsungan hidup mereka di lahan basah Pulau Kembang."
          },
          {
            "type": "instruction",
            "text": "Cari semua tumbuhan yang memiliki **jumlah** sebanyak kurang dari sama dengan 15 pada data **tumbuhan**. ",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM Tumbuhan WHERE jumlah <= 15;"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah mengidentifikasi tumbuhan yang jumlahnya sedikit."
          }
        ]
      },
      {
        "id": 4,
        "title": "Menemukan Tumbuhan dengan Populasi Besar",
        "dialogs": [
          {
            "type": "narration",
            "text": "Populasi tumbuhan yang besar berperan penting dalam stabilitas ekosistem lahan basah. "
          },
          {
            "type": "instruction",
            "text": "Cari tumbuhan dengan **jumlah** sebanyak lebih dari sama dengan 30 pada data **tumbuhan** untuk melihat spesies yang mendominasi wilayah ini.",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM Tumbuhan WHERE jumlah >= 30;"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah menemukan tumbuhan dengan populasi besar."
          },
          {
            "type": "narration",
            "text": "Keberadaan mereka sangat penting dalam menjaga fungsi ekosistem lahan basah, terutama dalam hal siklus air dan penyerapan karbon."
          }
        ]
      },
      {
        "id": 5,
        "title": "Menghitung Tumbuhan Berdasarkan Status Konservasi",
        "dialogs": [
          {
            "type": "narration",
            "text": "Untuk upaya konservasi yang lebih efektif, kita perlu fokus pada tumbuhan dengan status konservasi selain Least Concern."
          },
          {
            "type": "instruction",
            "text": "Temukan data **tumbuhan** yang **status konservasi**nya bukan **Least Concern**. Petunjuk : Sesuaikan penulisan isi data dan kolom dengan data tumbuhan dan gunakan operator perbandingan",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM Tumbuhan WHERE status_konservasi <> 'Least Concern';"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah menemukan tumbuhan dengan status konservasi selain 'Least Concern'."
          }
        ]
      }
    ],
    "closing": "Luar biasa! Kamu telah menyelesaikan semua misi di stage ini. Setiap langkah yang kamu ambil telah berkontribusi pada perlindungan dan pelestarian tumbuhan di Pulau Kembang. Kerja kerasmu tidak hanya membantu penelitian ilmiah, tetapi juga menjaga keanekaragaman hayati untuk generasi mendatang. Terima kasih atas dedikasi dan semangat konservasimu!",
    "filepath": "stage2.db"
  },
  {
    "id": 3,
    "title": "Memahami Populasi Hewan",
    "introduction": "Kali ini kamu bertugas memonitor dan menganalisa populasi hewan di Pulau Kembang. Setiap misi yang kamu selesaikan akan membantu kita memahami dan melestarikan keanekaragaman hayati pulau ini. Bersiaplah untuk mengaplikasikan operasi aritmatika dalam analisis datamu!",
    "missions": [
      {
        "id": 1,
        "title": "Menghitung Total Populasi",
        "dialogs": [
          {
            "type": "narration",
            "text": "Untuk membantu upaya konservasi, kita perlu mengetahui total populasi saat ini setelah penambahan individu baru."
          },
          {
            "type": "narration",
            "text": "Mari kita hitung total populasi Elang Laut Perut Putih setelah penambahan 5 individu."
          },
          {
            "type": "instruction",
            "text": "Hitung **jumlah** populasi **Elang Laut Perut Putih** pada data **hewan** setelah menambahkan 5 elang yang baru di Pulau Kembang.",
            "sql": {
              "type": "exec",
              "query": "SELECT jumlah + 5 FROM hewan WHERE nama = 'Elang Laut Perut Putih';"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah menghitung total populasi Elang Laut Perut Putih setelah penambahan 5 individu."
          }
        ]
      },
      {
        "id": 2,
        "title": "Mengurangi Jumlah Populasi Tertentu",
        "dialogs": [
          {
            "type": "narration",
            "text": "Mari kita analisis dampak dari penurunan populasi spesies tertentu. Hitung populasi setelah mengurangi 5 kera dari populasi Kera Ekor Panjang."
          },
          {
            "type": "instruction",
            "text": "Tampilkan **jumlah** populasi **Kera Ekor Panjang** setelah mengurangi 5 Kera Ekor Panjang di data **hewan**.",
            "sql": {
              "type": "exec",
              "query": "SELECT jumlah - 5 FROM hewan WHERE nama = 'Kera Ekor Panjang';"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah berhasil menghitung populasi Kera Ekor Panjang setelah pengurangan."
          }
        ]
      },
      {
        "id": 3,
        "title": "Mengalikan Populasi untuk Perkiraan Pertumbuhan",
        "dialogs": [
          {
            "type": "narration",
            "text": "Untuk merencanakan upaya pelestarian, kita harus memprediksi pertumbuhan populasi."
          },
          {
            "type": "narration",
            "text": "Mari kita hitung potensi pertumbuhan Elang Bondol dalam 5 tahun jika populasinya berlipat ganda setiap tahun."
          },
          {
            "type": "instruction",
            "text": "Tampilkan **jumlah** populasi **Elang Bondol** pada data **hewan** yang meningkat dua kali lipat setiap tahun selama 5 tahun. ",
            "sql": {
              "type": "exec",
              "query": "SELECT jumlah * 2 * 5 FROM hewan WHERE nama = 'Elang Bondol';"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah menghitung perkiraan populasi Elang Bondol dalam 5 tahun."
          }
        ]
      },
      {
        "id": 4,
        "title": "Membagi Populasi Dua Hewan",
        "dialogs": [
          {
            "type": "narration",
            "text": "Untuk memahami perbedaan populasi antara dua spesies hewan, mari kita bandingkan jumlah populasi spesies Bekantan dan Musang Luwak."
          },
          {
            "type": "narration",
            "text": "Dengan membagi populasi Bekantan dengan Musang Luwak, kita dapat mengetahui seberapa besar populasi Bekantan dibandingkan dengan Musang Luwak"
          },
          {
            "type": "narration",
            "text": "Dan ini membantu kita memahami distribusi populasi hewan yang lebih baik di Pulau Kembang."
          },
          {
            "type": "instruction",
            "text": "Bagi **jumlah** populasi **Bekantan** dengan populasi **Musang Luwak** yang ada di data **hewan**. Petunjuk : Gunakan subquery dan sesuaikan penulisan dengan isi data hewan.",
            "sql": {
              "type": "exec",
              "query": "SELECT (SELECT jumlah FROM hewan WHERE nama = 'Bekantan') / (SELECT jumlah FROM hewan WHERE nama = 'Musang Luwak')"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah berhasil mengetahui perbandingan populasi Bekantan dengan Musang Luwak!"
          }
        ]
      },
      {
        "id": 5,
        "title": " Menghitung Sisa Populasi setelah Pembagian",
        "dialogs": [
          {
            "type": "narration",
            "text": "Untuk program penangkaran Bekantan, kita perlu membagi populasi mereka menjadi kelompok yang lebih kecil untuk memudahkan pengelolaan."
          },
          {
            "type": "narration",
            "text": "Mari kita hitung sisa populasi Bekantan setelah dibagi dengan 5 untuk melihat apakah populasinya dapat dibagi rata ke dalam lima kelompok penangkaran."
          },
          {
            "type": "instruction",
            "text": "Hitung sisa **jumlah** populasi **Bekantan** di data **hewan** setelah di bagi dengan 5 untuk melihat apakah populasinya dapat dibagi rata ke dalam lima kelompok penangkaran.",
            "sql": {
              "type": "exec",
              "query": "SELECT jumlah % 5 FROM hewan WHERE nama = 'Bekantan';"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah menghitung sisa populasi Bekantan setelah dibagi dengan 5."
          },
          {
            "type": "narration",
            "text": "Ini akan membantu kita merencanakan kelompok penangkaran dengan lebih baik dan memastikan populasi dapat dikelola secara efektif."
          }
        ]
      }
    ],
    "closing": "Hebat sekali! Setiap langkah yang kamu ambil telah memberikan kita wawasan berharga mengenai populasi hewan di Pulau Kembang. Pengetahuan ini sangat penting untuk upaya konservasi kita ke depan. Terima kasih atas kerja keras dan dedikasimu dalam melestarikan kehidupan liar di pulau ini!",
    "filepath": "stage3.db"
  },
  {
    "id": 4,
    "title": "Eksplorasi Lanjutan Pulau Kembang",
    "introduction": "Selamat datang di Eksplorasi Lanjutan Pulau Kembang! Pada tahap ini, kamu akan mendalami data dan informasi yang lebih mendetail mengenai berbagai aspek di Pulau Kembang. Setiap misi dirancang untuk meningkatkan pemahamanmu tentang ekosistem dan pengelolaan pulau ini. Mari kita mulai petualangan ini dan temukan informasi berharga yang akan membantu dalam pelestarian pulau.",
    "missions": [
      {
        "id": 1,
        "title": "Menemukan Hewan Berdasarkan Rentang Jumlah",
        "dialogs": [
          {
            "type": "narration",
            "text": "Pulau Kembang dihuni oleh berbagai spesies hewan dengan populasi yang berbeda."
          },
          {
            "type": "narration",
            "text": "Sekarang, kita akan fokus pada hewan-hewan yang populasinya berada dalam rentang 10 hingga 30."
          },
          {
            "type": "instruction",
            "text": "Tampilkan data **hewan** yang **jumlah** populasinya berada antara 10 dan 30.",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM hewan WHERE jumlah BETWEEN 10 AND 30;"
            }
          },
          {
            "type": "narration",
            "text": "Bagus sekali! Kamu sekarang tahu hewan-hewan yang populasinya berada dalam rentang yang sudah ditentukan."
          }
        ]
      },
      {
        "id": 2,
        "title": "Menemukan Hewan dengan Kriteria Tertentu",
        "dialogs": [
          {
            "type": "narration",
            "text": "Kamu ingin mengetahui lebih lanjut tentang hewan-hewan di Pulau Kembang yang tidak termasuk dalam kategori Least concern, untuk fokus pada spesies yang lebih membutuhkan perhatian konservasi."
          },
          {
            "type": "instruction",
            "text": "Tampilkan data **hewan** yang **status konservasi**nya bukan **Least Concern**. Petunjuk : Sesuaikan penulisan isi data dan kolom dengan tabel tumbuhan.",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM hewan WHERE NOT status_konservasi = 'Least Concern';"
            }
          },
          {
            "type": "narration",
            "text": "Bagus sekali! Kamu telah menemukan hewan yang sesuai dengan kriteria tersebut. Informasi ini penting untuk upaya konservasi di pulau."
          }
        ]
      },
      {
        "id": 3,
        "title": "Menemukan Habitat Tumbuhan",
        "dialogs": [
          {
            "type": "narration",
            "text": "Kamu ingin menemukan tumbuhan yang habitatnya mengandung kata pantai."
          },
          {
            "type": "narration",
            "text": "Mari kita lakukan pencarian berdasarkan kata tersebut dalam deskripsi habitat tumbuhan."
          },
          {
            "type": "instruction",
            "text": "Temukan semua **tumbuhan** dengan **habitat** yang mengandung kata **pantai**.",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM tumbuhan WHERE habitat LIKE '%pantai%';"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah berhasil menemukan semua tumbuhan yang habitatnya mengandung kata 'pantai'."
          }
        ]
      },
      {
        "id": 4,
        "title": "Mencari Nama Tumbuhan",
        "dialogs": [
          {
            "type": "narration",
            "text": "Saat melakukan pencatatan, kamu lupa nama lengkap tumbuhan tetapi ingat bahwa nama tumbuhan tersebut terdiri dari empat huruf dengan akhiran ai."
          },
          {
            "type": "narration",
            "text": "Mari kita cari tumbuhan dengan kriteria tersebut."
          },
          {
            "type": "instruction",
            "text": "Temukan semua **tumbuhan** yang **nama**nya terdiri dari empat huruf dengan akhiran **ai**",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM tumbuhan WHERE nama LIKE '__ai';"
            }
          },
          {
            "type": "narration",
            "text": "Bagus! Kamu sekarang tahu nama-nama tumbuhan yang sesuai dengan kriteria yang telah ditentukan."
          }
        ]
      },
      {
        "id": 5,
        "title": "Menemukan Lama Hidup Hewan",
        "dialogs": [
          {
            "type": "narration",
            "text": "Mengidentifikasi hewan dengan rentang lama hidup tertentu sangat penting dalam upaya konservasi."
          },
          {
            "type": "narration",
            "text": "Hewan yang memiliki lama hidup 7 hingga 14 tahun sering menjadi fokus dalam program konservasi, karena mereka umumnya berada pada tahap reproduktif"
          },
          {
            "type": "instruction",
            "text": "Temukan semua **hewan** yang **lama hidup** berada dalam rentang 7 hingga 14 tahun. Petunjuk : Sesuaikan penulisan nama kolom dengan yang ada pada data tumbuhan. ",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM hewan WHERE lama_hidup BETWEEN 7 AND 14;"
            }
          },
          {
            "type": "narration",
            "text": "Luar biasa! Kamu telah berhasil menemukan semua hewan yang lama hidupnya berada dalam rentang 7 hingga 14 tahun."
          },
          {
            "type": "narration",
            "text": "Informasi ini sangat berguna untuk membantu dalam program konservasi, karena spesies ini berada dalam fase penting untuk kelangsungan hidup dan pemulihan populasi."
          }
        ]
      }
    ],
    "closing": "Selamat! Kamu telah berhasil menyelesaikan semua misi dalam Eksplorasi Lanjutan Pulau Kembang. Semua informasi ini sangat berharga untuk memahami dan melestarikan Pulau Kembang dengan lebih baik. Teruslah menjelajah dan belajar lebih banyak tentang lingkungan di sekitarmu!",
    "filepath": "stage4.db"
  },
  {
    "id": 5,
    "title": "Mengurutkan Data Pulau Kembang",
    "introduction": "Dalam stage ini, kamu akan membantu mengelola berbagai aspek di Pulau Kembang, sebuah kawasan konservasi hutan mangrove di Kalimantan Selatan yang menjadi habitat bagi flora seperti rambai dan nipah serta fauna langka seperti bekantan. Kamu akan ditugaskan untuk mengatur data terkait tumbuhan, petugas, biaya, fasilitas, dan hewan demi kesejahteraan dan efisiensi pengelolaan pulau. Setiap misi memiliki tujuan khusus yang penting bagi kelestarian lingkungan Pulau Kembang, memastikan ekosistem tetap terjaga bagi keanekaragaman hayati dan pengunjung.",
    "missions": [
      {
        "id": 1,
        "title": "Menyusun Tumbuhan Berdasarkan Nama",
        "dialogs": [
          {
            "type": "narration",
            "text": "Pengunjung Pulau Kembang tertarik dengan keanekaragaman flora yang ada, seperti pohon rambai dan jambu. "
          },
          {
            "type": "narration",
            "text": "Untuk memudahkan, susunlah data nama tumbuhan dari A ke Z."
          },
          {
            "type": "instruction",
            "text": "Tampilkan data **tumbuhan** dengan **nama** yang diurutkan dari A ke Z.",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM tumbuhan ORDER BY nama ASC;"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah berhasil menyusun nama tumbuhan dari A ke Z, memudahkan pendataan tumbuhan di Pulau Kembang."
          }
        ]
      },
      {
        "id": 2,
        "title": "Menyusun Fasilitas Berdasarkan Jumlah",
        "dialogs": [
          {
            "type": "narration",
            "text": "Untuk menjaga fasilitas wisata seperti tempat istirahat di Pulau Kembang, penting untuk mengetahui jumlah setiap fasilitas."
          },
          {
            "type": "narration",
            "text": "Dengan data ini, pemeliharaan fasilitas di kawasan konservasi mangrove ini dapat dilakukan secara efisien."
          },
          {
            "type": "instruction",
            "text": "Urutkan data **fasilitas** berdasarkan **jumlah** dari terbesar ke terkecil.",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM fasilitas ORDER BY jumlah DESC;"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah mengurutkan fasilitas dari terbesar ke terkecil, mendukung pengelolaan sarana di Pulau Kembang."
          }
        ]
      },
      {
        "id": 3,
        "title": "Menemukan Tumbuhan Terbanyak",
        "dialogs": [
          {
            "type": "narration",
            "text": " Sebagai hutan mangrove, Pulau Kembang memiliki banyak tumbuhan khas."
          },
          {
            "type": "narration",
            "text": "Menemukan tumbuhan yang paling banyak jumlahnya sangat penting untuk fokus konservasi."
          },
          {
            "type": "instruction",
            "text": "Urutkan data **tumbuhan** berdasarkan **jumlah** dari terbesar ke terkecil dan batasi hasilnya menjadi 1 teratas.",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM tumbuhan ORDER BY jumlah DESC LIMIT 1;"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah menemukan tumbuhan dengan jumlah terbanyak, membantu fokus upaya konservasi di pulau ini."
          }
        ]
      },
      {
        "id": 4,
        "title": "Menentukan Hari dengan Biaya Termurah",
        "dialogs": [
          {
            "type": "narration",
            "text": "Pengunjung Pulau Kembang sering mencari hari dengan biaya terendah untuk merencanakan kunjungan mereka."
          },
          {
            "type": "instruction",
            "text": "Urutkan data **biaya** berdasarkan **harga** dari terkecil ke terbesar untuk wisatawan **lokal** dan batasi hasilnya menjadi 1 teratas.",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM biaya WHERE wisatawan = 'Lokal' ORDER BY harga LIMIT 1;"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah menemukan hari dengan biaya terendah untuk wisatawan lokal."
          }
        ]
      },
      {
        "id": 5,
        "title": "Menemukan Hewan dengan Jumlah Terbanyak",
        "dialogs": [
          {
            "type": "narration",
            "text": " Pulau Kembang terkenal dengan fauna endemiknya, termasuk bekantan dan elang laut."
          },
          {
            "type": "narration",
            "text": "Penting untuk mengetahui hewan mana yang paling banyak jumlahnya untuk memastikan habitat yang tepat dan keseimbangan ekosistem tetap terjaga."
          },
          {
            "type": "instruction",
            "text": "Urutkan data **hewan** berdasarkan **jumlah** dari terbesar ke terkecil dan batasi hasilnya menjadi 1 teratas ",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM hewan ORDER BY jumlah DESC LIMIT 1;"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah menemukan hewan dengan jumlah paling banyak."
          }
        ]
      }
    ],
    "closing": "Selamat! Kamu telah menyelesaikan semua misi dalam stage ini. Dengan mengelola data tumbuhan, fasilitas, biaya, dan hewan, kamu telah berperan penting dalam menjaga kelestarian Pulau Kembang yang berharga. Teruskan upaya ini untuk melindungi flora dan fauna langka di hutan mangrove yang unik ini!",
    "filepath": "stage5.db"
  },
  {
    "id": 6,
    "title": "Menganalisis Data Tumbuhan",
    "introduction": "Pada tahap ini, kamu akan menganalisis data populasi tumbuhan di Pulau Kembang, yang merupakan kawasan konservasi dengan keanekaragaman flora seperti pohon rambai, nipah, dan tancang. Analisis ini akan membantu kita memahami distribusi dan jumlah setiap spesies, yang sangat penting untuk menjaga keseimbangan ekosistem pulau ini. Siap untuk menggali data dan mendapatkan wawasan lebih mendalam tentang flora unik Pulau Kembang?",
    "missions": [
      {
        "id": 1,
        "title": "Menemukan Tumbuhan dengan Jumlah Maksimum",
        "dialogs": [
          {
            "type": "narration",
            "text": "Di Pulau Kembang, beberapa tumbuhan mendominasi hutan mangrove. Mengetahui tumbuhan yang paling banyak jumlahnya akan membantu kita fokus dalam usaha pelestarian."
          },
          {
            "type": "instruction",
            "text": "Tampilkan **nama** tumbuhan dan **jumlah terbanyak** yang ditemukan di data **tumbuhan**. Petunjuk : Buat data jumlah terbanyak dengan alias.",
            "sql": {
              "type": "exec",
              "query": "SELECT nama, MAX(jumlah) AS jumlah_terbanyak FROM tumbuhan;"
            }
          },
          {
            "type": "narration",
            "text": "Selamat! Kamu telah menemukan tumbuhan dengan jumlah terbanyak di Pulau Kembang. Ini akan menjadi informasi penting dalam perencanaan konservasi."
          }
        ]
      },
      {
        "id": 2,
        "title": "Menemukan Tumbuhan dengan Jumlah Minimum",
        "dialogs": [
          {
            "type": "narration",
            "text": "Selain spesies dominan, penting juga untuk mengetahui spesies tumbuhan yang jarang ditemukan di Pulau Kembang, seperti tumbuhan dengan populasi yang paling sedikit."
          },
          {
            "type": "narration",
            "text": "Informasi ini akan membantu kita memperhatikan spesies tumbuhan yang mungkin membutuhkan perhatian lebih dalam konservasi di Pulau Kembang."
          },
          {
            "type": "instruction",
            "text": "Cari tumbuhan dengan **jumlah** paling sedikit dan tampilkan **nama** serta **jumlah terkecil** dari data **tumbuhan**. Petunjuk : Buat data jumlah terbanyak dengan alias.",
            "sql": {
              "type": "exec",
              "query": "SELECT nama, MIN(jumlah) AS jumlah_terkecil FROM tumbuhan;"
            }
          },
          {
            "type": "narration",
            "text": "Hebat! Kamu telah menemukan tumbuhan dengan jumlah paling sedikit di Pulau Kembang."
          }
        ]
      },
      {
        "id": 3,
        "title": "Menghitung Rata-Rata Jumlah Tumbuhan",
        "dialogs": [
          {
            "type": "narration",
            "text": "Untuk mendapatkan gambaran umum mengenai distribusi tumbuhan di Pulau Kembang, mari kita hitung rata-rata jumlah populasi tiap spesies yang ada."
          },
          {
            "type": "instruction",
            "text": "Hitung rata-rata **jumlah** tumbuhan yang ada di data tumbuhan! Petunjuk : Gunakan operator SQL untuk menghitungnya.",
            "sql": {
              "type": "exec",
              "query": "SELECT AVG(jumlah) FROM tumbuhan;"
            }
          },
          {
            "type": "narration",
            "text": "Luar biasa! Kamu kini memiliki informasi tentang rata-rata populasi tumbuhan di Pulau Kembang, yang membantu memahami keseimbangan flora di sana."
          }
        ]
      },
      {
        "id": 4,
        "title": "Menghitung Jumlah Keseluruhan Tumbuhan",
        "dialogs": [
          {
            "type": "narration",
            "text": "Penting bagi kita untuk mengetahui jumlah keseluruhan tumbuhan yang ada di Pulau Kembang, guna memahami keanekaragaman flora yang ada di seluruh area pulau."
          },
          {
            "type": "instruction",
            "text": "Hitunglah total keseluruhan **jumlah** dari data **tumbuhan** di Pulau Kembang! Petunjuk : Gunakan operator SQL untuk menghitungnya.",
            "sql": {
              "type": "exec",
              "query": "SELECT SUM(jumlah) FROM tumbuhan;"
            }
          },
          {
            "type": "narration",
            "text": "Bagus sekali! Kamu telah menghitung jumlah semua tumbuhan di Pulau Kembang, memberikan kita gambaran tentang skala keanekaragaman flora di pulau ini."
          }
        ]
      },
      {
        "id": 5,
        "title": "Menghitung Jumlah Jenis Tumbuhan",
        "dialogs": [
          {
            "type": "narration",
            "text": "Dengan menghitung banyak jenis tumbuhan yang berbeda di Pulau Kembang, kita dapat memahami seberapa besar variasi spesies tumbuhan di hutan mangrove ini, yang penting bagi ekosistemnya."
          },
          {
            "type": "instruction",
            "text": "Hitunglah **banyak** seluruh tumbuhan yang ada di data **tumbuhan**!",
            "sql": {
              "type": "exec",
              "query": "SELECT COUNT(*) FROM tumbuhan;"
            }
          },
          {
            "type": "narration",
            "text": "Luar biasa! Kamu telah berhasil mengidentifikasi banyaknya spesies tumbuhan yang ada di Pulau Kembang. Informasi ini sangat penting untuk memahami keragaman flora dan membantu dalam perencanaan konservasi."
          }
        ]
      }
    ],
    "closing": "Selamat! Kamu telah sukses menganalisis data tumbuhan di Pulau Kembang. Setiap langkah yang kamu lakukan memberikan wawasan penting mengenai populasi tumbuhan di pulau ini. Pengetahuan ini sangat berharga untuk memastikan kelangsungan ekosistem Pulau Kembang, membantu menjaga keseimbangan antara flora, fauna, dan habitat mereka. Teruskan usaha ini demi kelestarian lingkungan yang kita cintai!",
    "filepath": "stage6.db"
  },
  {
    "id": 7,
    "title": "Menghitung Biaya Wisata",
    "introduction": "Dalam tahap ini, kamu akan menganalisis biaya masuk ke Pulau Kembang untuk dua kategori wisatawan: lokal dan mancanegara. Kamu akan mengerjakan misi-misi terpisah untuk masing-masing kategori untuk mendapatkan wawasan yang lebih jelas tentang biaya yang dibayar. Ayo mulai eksplorasi data biaya!",
    "missions": [
      {
        "id": 1,
        "title": "Menemukan Harga Termurah untuk Wisatawan Lokal",
        "dialogs": [
          {
            "type": "narration",
            "text": "Kita akan memulai dengan mencari harga termurah yang dibayar oleh wisatawan lokal. Ini akan membantu kita memahami biaya minimum yang dikeluarkan oleh wisatawan lokal."
          },
          {
            "type": "instruction",
            "text": "Temukan **harga** termurah dari data **biaya** untuk wisatawan **Lokal**. Petunjuk: Sesuaikan penulisan dengan data biaya.",
            "sql": {
              "type": "exec",
              "query": "SELECT MIN(harga) FROM biaya WHERE wisatawan = 'Lokal';"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah menemukan harga termurah yang dibayar oleh wisatawan lokal."
          }
        ]
      },
      {
        "id": 2,
        "title": "Total Biaya untuk Wisatawan Mancanegara pada Hari Libur",
        "dialogs": [
          {
            "type": "narration",
            "text": "Mari kita hitung total biaya yang dibayar oleh wisatawan mancanegara selama hari libur (Sabtu dan Minggu). "
          },
          {
            "type": "narration",
            "text": "Informasi ini akan membantu mengetahui pengeluaran dari wisatawan mancanegara yang mengunjungi Pulau Kembang pada akhir pekan."
          },
          {
            "type": "instruction",
            "text": "Hitung **total biaya** masuk dari data **biaya** untuk wisatawan **Mancanegara** yang berkunjung pada **Hari Libur**. Petunjuk: Buat data total biaya dengan alias serta gunakan operator SQL untuk menghitungnya.",
            "sql": {
              "type": "exec",
              "query": "SELECT SUM(harga) AS total_biaya FROM biaya WHERE wisatawan = 'Mancanegara' AND hari = 'Hari Libur';"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah berhasil menghitung total biaya yang dibayar oleh wisatawan mancanegara pada hari libur."
          }
        ]
      },
      {
        "id": 3,
        "title": "Biaya Tertinggi untuk Wisatawan Lokal",
        "dialogs": [
          {
            "type": "narration",
            "text": "Selanjutnya, mari kita cari harga tertinggi yang dibayar oleh wisatawan lokal."
          },
          {
            "type": "narration",
            "text": "Ini memberikan gambaran tentang biaya maksimum yang mungkin dikeluarkan oleh wisatawan lokal."
          },
          {
            "type": "instruction",
            "text": "Temukan **harga** tertinggi dari data **biaya** untuk wisatawan **Lokal**! Petunjuk : Sesuaikan penulisan dengan data biaya.",
            "sql": {
              "type": "exec",
              "query": "SELECT MAX(harga) FROM biaya WHERE wisatawan = 'Lokal';"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah menemukan harga tertinggi yang dibayar oleh wisatawan lokal"
          }
        ]
      },
      {
        "id": 4,
        "title": "Rata-Rata Biaya untuk Wisatawan Mancanegara",
        "dialogs": [
          {
            "type": "narration",
            "text": "Kemudian, mari kita hitung rata-rata biaya yang dibayar oleh wisatawan mancanegara."
          },
          {
            "type": "narration",
            "text": "Ini akan memberikan gambaran tentang biaya rata-rata yang dikeluarkan per hari untuk wisatawan mancanegara."
          },
          {
            "type": "instruction",
            "text": "Hitung rata-rata **harga** dari data **biaya** untuk wisatawan **Mancanegara**. Petunjuk: Sesuaikan penulisan dengan data biaya.",
            "sql": {
              "type": "exec",
              "query": "SELECT AVG(harga) FROM biaya WHERE wisatawan = 'Mancanegara';"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah berhasil menghitung rata-rata biaya yang dibayar oleh wisatawan mancanegara."
          }
        ]
      },
      {
        "id": 5,
        "title": "Menghitung Jumlah Biaya yang Berbeda",
        "dialogs": [
          {
            "type": "narration",
            "text": "Mari kita cari tahu berapa banyak biaya berbeda yang tercatat di Pulau Kembang."
          },
          {
            "type": "narration",
            "text": "Ini memberikan gambaran tentang variasi biaya secara keseluruhan tanpa memisahkan wisatawan."
          },
          {
            "type": "instruction",
            "text": "Hitung banyaknya **harga** yang berbeda di data **biaya** dan tampilkan hasilnya dengan nama **jumlah biaya berbeda**.",
            "sql": {
              "type": "exec",
              "query": "SELECT COUNT(DISTINCT harga) AS jumlah_biaya_berbeda FROM biaya;"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah berhasil menghitung jumlah biaya yang berbeda yang tercatat di Pulau Kembang."
          }
        ]
      }
    ],
    "closing": "Luar biasa! Dengan analisis ini, kita sekarang memiliki pemahaman yang lebih baik tentang biaya masuk untuk wisatawan lokal dan mancanegara di Pulau Kembang. Terima kasih atas usahamu dalam menggali informasi dari data biaya ini!",
    "filepath": "stage7.db"
  },
  {
    "id": 8,
    "title": "Menganalisis Data Hewan",
    "introduction": "Di tahap ini, kamu akan menganalisis data hewan yang tinggal di Pulau Kembang. Lahan basah di Pulau Kembang berperan penting sebagai habitat alami bagi berbagai spesies hewan, dan pemahaman tentang data ini akan membantu dalam upaya pelestarian ekosistem.",
    "missions": [
      {
        "id": 1,
        "title": "Menampilkan Seluruh Data Hewan",
        "dialogs": [
          {
            "type": "narration",
            "text": "Untuk memulai, kita akan melihat semua data hewan yang tersedia di Pulau Kembang."
          },
          {
            "type": "narration",
            "text": "Setiap hewan memainkan peran penting dalam menjaga keseimbangan ekosistem lahan basah."
          },
          {
            "type": "instruction",
            "text": "Tampilkan seluruh hewan dari data **hewan**",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM hewan;"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah berhasil menampilkan seluruh data hewan. Ini memberikan dasar yang baik untuk analisis lebih lanjut"
          }
        ]
      },
      {
        "id": 2,
        "title": "Mengurutkan Nama Hewan Secara Alfabetis",
        "dialogs": [
          {
            "type": "narration",
            "text": "Sekarang, kita akan mengurutkan nama-nama hewan secara alfabet untuk memudahkan pencarian dan identifikasi."
          },
          {
            "type": "instruction",
            "text": "Tampilkan semua **nama** hewan dari data **hewan** secara berurutan dari A hingga Z.",
            "sql": {
              "type": "exec",
              "query": "SELECT * FROM hewan ORDER BY nama;"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah berhasil mengurutkan nama hewan secara alfabet. Ini memudahkan pencarian dan pengelompokan informasi."
          }
        ]
      },
      {
        "id": 3,
        "title": "Menemukan Hewan dengan Lama Hidup di Atas Rata-Rata",
        "dialogs": [
          {
            "type": "narration",
            "text": "Sekarang, kita akan fokus pada hewan yang memiliki lama hidup di atas rata-rata."
          },
          {
            "type": "narration",
            "text": "Hewan-hewan ini dapat memberikan wawasan lebih lanjut tentang faktor-faktor yang mendukung kelangsungan hidup di Pulau Kembang."
          },
          {
            "type": "instruction",
            "text": "Tampilkan **nama** hewan dari data **hewan** yang memiliki **lama hidup** di atas rata-rata. Petunjuk: Gunakan subquery dan sesuaikan penulisan dengan isi data hewan",
            "sql": {
              "type": "exec",
              "query": "SELECT nama, lama_hidup FROM hewan WHERE lama_hidup > (SELECT AVG(lama_hidup) FROM hewan);"
            }
          },
          {
            "type": "narration",
            "text": "Selamat! Kamu telah berhasil menampilkan jenis makanan dan menghitung jumlah hewan yang mengonsumsi setiap jenis makanan."
          }
        ]
      },
      {
        "id": 4,
        "title": "Mengelompokkan dan Mengurutkan Hewan Berdasarkan Status Konservasi",
        "dialogs": [
          {
            "type": "narration",
            "text": "Sekarang kita akan mengelompokkan hewan berdasarkan status konservasinya dan mengurutkan dari yang paling banyak hingga paling sedikit."
          },
          {
            "type": "narration",
            "text": "Informasi ini penting untuk memahami ancaman yang dihadapi oleh spesies yang menghuni lahan basah di Pulau Kembang."
          },
          {
            "type": "instruction",
            "text": "Kelompokkan data **hewan** berdasarkan **status konservasi** dan urutkan hasilnya berdasarkan **jumlah** hewan dalam masing-masing status dari yang paling banyak ke sedikit. Ubah juga nama kolom hasil dengan jumlah.",
            "sql": {
              "type": "exec",
              "query": "SELECT status_konservasi, COUNT(*) AS jumlah FROM hewan GROUP BY status_konservasi ORDER BY jumlah DESC;"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah berhasil mengelompokkan dan mengurutkan hewan berdasarkan status konservasi mereka. Ini memberikan gambaran jelas tentang prioritas konservasi."
          }
        ]
      },
      {
        "id": 5,
        "title": "Mengurutkan Hewan Berdasarkan Lama Hidup dari yang Terpendek",
        "dialogs": [
          {
            "type": "narration",
            "text": "Terakhir, kita akan mengurutkan hewan berdasarkan lama hidup mereka. Pengetahuan tentang umur rata-rata hewan membantu memahami siklus hidup mereka."
          },
          {
            "type": "instruction",
            "text": "Tampilkan **nama** dan **lama hidup** hewan dari data **hewan**, yang diurutkan dari lama hidup terpendek hingga terpanjang.",
            "sql": {
              "type": "exec",
              "query": "SELECT nama, lama_hidup FROM hewan ORDER BY lama_hidup ASC;"
            }
          },
          {
            "type": "narration",
            "text": "Kamu telah berhasil mengurutkan hewan berdasarkan lama hidup mereka. Ini memberikan wawasan tentang umur rata-rata hewan di pulau."
          }
        ]
      }
    ],
    "closing": "Selamat, misi kamu di Stage 8 telah selesai! Dengan menyelesaikan misi ini, kamu telah memperoleh pemahaman yang lebih baik tentang data hewan di Pulau Kembang. Terima kasih atas usaha dan dedikasi kamu dalam menganalisis informasi ini. Teruskan kerja bagusmu dan siap-siap untuk tantangan berikutnya!",
    "filepath": "stage8.db"
  },
  {
    "id": 9,
    "title": "Pengelolaan Data Pulau Kembang",
    "introduction": "Di sini, kamu akan meningkatkan keterampilan penting dalam menjaga dan memperbarui informasi yang mendukung kelestarian Pulau Kembang. Setiap misi yang kamu selesaikan akan berkontribusi langsung pada pelestarian pulau dan kelangsungan ekosistem lahan basah. Apakah kamu siap menghadapi tantangan ini? Ayo kita mulai dengan penuh semangat!",
    "missions": [
      {
        "id": 1,
        "title": "Menambahkan Data Petugas Baru",
        "dialogs": [
          {
            "type": "narration",
            "text": "Pulau Kembang sedang berkembang dan membutuhkan lebih banyak petugas untuk menjaga ekosistem dan melayani pengunjung."
          },
          {
            "type": "narration",
            "text": "Kamu bertemu dengan Fatimah, seorang petugas baru yang bergabung sebagai pemandu wisata di pulau ini."
          },
          {
            "type": "instruction",
            "text": "Tugasmu adalah memasukkan informasi petugas yang memiliki **nama** Fatimah. Ia memiliki **tugas** sebagai Pemandu Wisata.",
            "sql": {
              "type": "run",
              "query": "INSERT INTO Petugas (nama, tugas) VALUES ('Fatimah', 'Pemandu Wisata');",
              "validation": "SELECT * FROM petugas WHERE id = last_insert_rowid() AND nama = 'Fatimah' AND tugas = 'Pemandu Wisata'"
            }
          },
          {
            "type": "narration",
            "text": "Kerja bagus! Dengan kehadiran Fatimah sebagai pemandu wisata, pengunjung kini bisa mendapatkan informasi yang lebih mendalam"
          }
        ]
      },
      {
        "id": 2,
        "title": "Menambahkan Data Fasilitas Baru",
        "dialogs": [
          {
            "type": "narration",
            "text": "Musholla di Pulau Kembang sudah lama tersedia, tetapi datanya belum dimasukkan untuk pendataan fasilitas."
          },
          {
            "type": "narration",
            "text": "Sekarang, saatnya memperbarui informasi ini agar tercatat dengan benar."
          },
          {
            "type": "instruction",
            "text": "Nah, sekarang masukkan informasi musholla ke data **fasilitas**. Adapun **nama** fasilitasnya Musholla, **jumlah** 1 buah, dengan **jenis** Fasilitas Umum, dan **status kelayakan** Layak.",
            "sql": {
              "type": "run",
              "query": "INSERT INTO fasilitas (nama, jumlah, jenis, status_kelayakan) VALUES ('Musholla', 1, 'Fasilitas Umum', 'Layak');)",
              "validation": "SELECT * FROM fasilitas WHERE id = last_insert_rowid() AND nama = 'Musholla' AND jumlah = 1 AND jenis = 'Fasilitas Umum' AND status_kelayakan = 'Layak'"
            }
          },
          {
            "type": "narration",
            "text": "Anda telah berhasil menambahkan data fasilitas baru. Dengan informasi ini, pengunjung dapat mengetahui adanya Musholla."
          }
        ]
      },
      {
        "id": 3,
        "title": "Mengupdate Jumlah Tumbuhan",
        "dialogs": [
          {
            "type": "narration",
            "text": "Ketika melakukan pengamatan di lahan basah, kamu menemukan bahwa populasi tumbuhan Nipah spesies penting bagi ekosistem meningkat dari 34 menjadi 41."
          },
          {
            "type": "instruction",
            "text": "Sekarang, perbarui data **tumbuhan** ini dengan memperbarui **jumlah** Nipah menjadi 41.",
            "sql": {
              "type": "run",
              "query": "UPDATE tumbuhan SET jumlah = 41 WHERE nama = 'Nipah';",
              "validation": "SELECT * FROM tumbuhan WHERE nama = 'Nipah' AND jumlah = 41"
            }
          },
          {
            "type": "narration",
            "text": "Hebat! Kamu telah berhasil memperbarui jumlah spesies Nipah."
          }
        ]
      },
      {
        "id": 4,
        "title": "Memperbarui Data Petugas",
        "dialogs": [
          {
            "type": "narration",
            "text": "Cahya, seorang petugas yang sebelumnya bertugas sebagai Penjaga Loket, kini dipindahkan ke posisi baru sebagai Petugas Kebersihan"
          },
          {
            "type": "instruction",
            "text": "Perbarui **tugas** Cahya sebagai Petugas Kebersihan di data **petugas** agar sesuai dengan tugas barunya.",
            "sql": {
              "type": "run",
              "query": "UPDATE petugas SET tugas = 'Petugas Kebersihan' WHERE nama = 'Cahya';",
              "validation": "SELECT * FROM petugas WHERE nama = 'Cahya' AND tugas = 'Petugas Kebersihan'"
            }
          },
          {
            "type": "narration",
            "text": "Kerja bagus, Petualang! Tugas petugas Cahya telah diperbarui."
          }
        ]
      },
      {
        "id": 5,
        "title": "Memperbarui Harga Tiket Wisatawan Lokal di Hari Libur",
        "dialogs": [
          {
            "type": "narration",
            "text": "Harga tiket wisatawan lokal pada Hari Libur akan dinaikkan dari 7500 menjadi 10000 untuk mendukung program konservasi."
          },
          {
            "type": "instruction",
            "text": "Perbarui **harga** tiket wisatawan **Lokal** di **Hari Libur** menjadi 10000. Pastikan perubahan dilakukan pada data biaya.",
            "sql": {
              "type": "run",
              "query": "UPDATE biaya SET harga = 10000 WHERE hari = 'Hari Libur' AND wisatawan = 'Lokal'; ",
              "validation": "SELECT * FROM biaya WHERE hari = 'Hari Libur' AND wisatawan = 'Lokal' AND harga = 10000"
            }
          },
          {
            "type": "narration",
            "text": "Bagus sekali! Harga tiket untuk wisatawan lokal pada hari Libur telah diperbarui."
          }
        ]
      }
    ],
    "closing": "Luar biasa! Anda telah berhasil menyelesaikan semua misi di tahap ini. Anda sekarang lebih mahir dalam memperbarui dan menambahkan data di database, keterampilan yang sangat penting untuk menjaga informasi tetap akurat dan terkini. Teruslah berlatih dan jangan berhenti belajar. Sampai jumpa di tahap berikutnya!",
    "filepath": "stage9.db"
  },
  {
    "id": 10,
    "title": "Peningkatan Pengelolaan Data",
    "introduction": "Selamat datang di tahap terakhir dalam petualangan Anda di Pulau Kembang. Pada tahap ini, Anda akan belajar cara mengelola data penting yang berhubungan dengan petugas, biaya tiket, dan fasilitas di pulau ini. Setiap misi akan memberikan Anda pengalaman langsung dalam menambahkan, memperbarui, dan menghapus data dari database, yang sangat penting untuk menjaga operasional pulau tetap efisien. Siap untuk memulai?",
    "missions": [
      {
        "id": 1,
        "title": "Menambahkan Data Petugas Baru",
        "dialogs": [
          {
            "type": "narration",
            "text": "Seorang petugas baru bernama 'Anang' telah bergabung dengan tim sebagai Petugas Kebersihan."
          },
          {
            "type": "narration",
            "text": "Tugas Anda adalah menambahkan informasi petugas baru ini ke dalam database."
          },
          {
            "type": "instruction",
            "text": "Masukkan data **petugas** baru dengan **nama** Anang dengan **tugas** sebagai **Petugas Kebersihan** ke data petugas",
            "sql": {
              "type": "run",
              "query": "INSERT INTO petugas (nama, tugas) VALUES ('Anang', 'Petugas Kebersihan');",
              "validation": "SELECT * FROM petugas WHERE id = last_insert_rowid() AND nama = 'Anang' AND tugas = 'Petugas Kebersihan'"
            }
          },
          {
            "type": "narration",
            "text": "Anda telah berhasil menambahkan petugas baru 'Anang' ke dalam database."
          }
        ]
      },
      {
        "id": 2,
        "title": "Memperbarui Harga Tiket Wisatawan Mancanegara di Hari Libur",
        "dialogs": [
          {
            "type": "narration",
            "text": "Harga tiket untuk wisatawan mancanegara pada Hari Libur akan dinaikkan dari '150000' menjadi '175000' untuk mendukung program konservasi di Pulau Kembang."
          },
          {
            "type": "instruction",
            "text": "Perbarui **harga** tiket wisatawan **Mancanegara** pada **Hari Libur** menjadi **175000** di data **biaya**.",
            "sql": {
              "type": "run",
              "query": "UPDATE biaya SET harga = 175000 WHERE hari = 'Hari Libur' AND wisatawan = 'Mancanegara';",
              "validation": "SELECT * FROM biaya WHERE hari = 'Hari Libur' AND wisatawan = 'Mancanegara' AND harga = 175000"
            }
          },
          {
            "type": "narration",
            "text": "Bagus sekali! Harga tiket untuk wisatawan mancanegara pada hari Libur telah berhasil diperbarui."
          }
        ]
      },
      {
        "id": 3,
        "title": "Menghapus Data Petugas",
        "dialogs": [
          {
            "type": "narration",
            "text": " Petugas bernama Tiwi telah dipindahkan ke lokasi lain dan tidak lagi bekerja di Pulau Kembang. Anda perlu menghapus data petugas ini"
          },
          {
            "type": "instruction",
            "text": "Hapuslah data **petugas** dengan **nama** Tiwi!",
            "sql": {
              "type": "run",
              "query": "DELETE FROM petugas WHERE nama = 'Tiwi'",
              "validation": "SELECT * FROM petugas WHERE nama = 'Tiwi'"
            }
          },
          {
            "type": "narration",
            "text": "Luar biasa! Anda telah berhasil menghapus data Tiwi dari database. Ini memastikan bahwa data petugas tetap akurat dan terkini."
          }
        ]
      },
      {
        "id": 4,
        "title": "Menghapus Data Petugas yang Sakit",
        "dialogs": [
          {
            "type": "narration",
            "text": "Petugas bernama Burhan telah mengundurkan diri karena sakit dan tidak lagi bekerja di Pulau Kembang. "
          },
          {
            "type": "narration",
            "text": "Tugas kamu adalah menghapus data petugas ini dari database."
          },
          {
            "type": "instruction",
            "text": "Hapuslah data **petugas** dengan **nama** Burhan!",
            "sql": {
              "type": "run",
              "query": "DELETE FROM petugas WHERE nama = 'Burhan';",
              "validation": "SELECT * FROM petugas WHERE nama = 'Burhan'"
            }
          },
          {
            "type": "narration",
            "text": "Luar biasa! Kamu telah berhasil menghapus data Hari Libur Nasional untuk wisatawan lokal dari database."
          }
        ]
      },
      {
        "id": 5,
        "title": "Menghapus Data Fasilitas",
        "dialogs": [
          {
            "type": "narration",
            "text": " Fasilitas Kantor Kehutanan sudah tidak aktif lagi di Pulau Kembang. Anda perlu menghapus data fasilitas ini."
          },
          {
            "type": "instruction",
            "text": "Hapus data **fasilitas** dengan **nama** Kantor Kehutanan dari data **fasilitas**.",
            "sql": {
              "type": "run",
              "query": "DELETE FROM fasilitas WHERE nama = 'Kantor Kehutanan'",
              "validation": "SELECT * FROM fasilitas WHERE nama = 'Kantor Kehutanan'"
            }
          },
          {
            "type": "narration",
            "text": "Bagus sekali! Kamu telah berhasil menghapus data Kantor Kehutanan dari database."
          }
        ]
      }
    ],
    "closing": "Luar biasa! Anda telah menyelesaikan semua misi dalam tahap ini dengan sukses. Anda telah belajar cara menambahkan, memperbarui, dan menghapus data dalam database, keterampilan penting untuk menjaga informasi tetap akurat. Teruslah berlatih dan tingkatkan kemampuan Anda dalam mengelola data untuk mendukung kelancaran operasional di Pulau Kembang.",
    "filepath": "stage10.db"
  }
]

